[
  {
    "title": "Indonesia bans deep-sea mining",
    "date": "2025-07-03",
    "content": "Indonesia imposed a nationwide ban on deep-sea mining, citing environmental risks and pressure from conservation groups. The government plans to prioritize sustainable marine practices. Additional updates are expected. Additional updates are expected. Additional updates are expected. Additional updates are expected. Additional updates are expected. Additional updates are expected."
  },
  {
    "title": "French farmers protest over EU pesticide bans",
    "date": "2025-07-02",
    "content": "Farmers across France blocked highways to protest new European Union restrictions on pesticide use. Tractors lined roads in Brittany and Normandy as protesters called for policy revisions. Additional updates are expected. Additional updates are expected. Additional updates are expected. Additional updates are expected. Additional updates are expected. Additional updates are expected."
  },
  {
    "title": "UN holds emergency session on Gaza ceasefire",
    "date": "2025-07-01",
    "content": "The United Nations convened an emergency session to address the ongoing conflict in Gaza, where recent airstrikes have left dozens dead. Global leaders urged an immediate ceasefire and humanitarian aid access. Additional updates are expected. Additional updates are expected. Additional updates are expected. Additional updates are expected. Additional updates are expected. Additional updates are expected."
  },
  {
    "title": "WHO declares end of latest Ebola outbreak in Congo",
    "date": "2025-06-30",
    "content": "The World Health Organization declared the latest Ebola outbreak in the Democratic Republic of Congo officially over after no new cases in 42 days. Additional updates are expected. Additional updates are expected. Additional updates are expected. Additional updates are expected."
  },
  {
    "title": "Russia announces new Arctic military base",
    "date": "2025-06-29",
    "content": "Russia unveiled a new military installation in the Arctic, equipped with missile defense systems and radar. NATO countries have expressed concern over increased tensions. Additional updates are expected. Additional updates are expected. Additional updates are expected. Additional updates are expected. Additional updates are expected."
  },
  {
    "title": "Norway becomes first country with fully electric ferry fleet",
    "date": "2025-06-28",
    "content": "Norway has converted all public ferries to electric power, becoming the first country to achieve the milestone. Officials say the move will cut 300,000 tons of CO₂ annually. Additional updates are expected. Additional updates are expected. Additional updates are expected."
  },
  {
    "title": "Canada wildfires force evacuation of thousands",
    "date": "2025-06-27",
    "content": "Wildfires burning across Alberta and British Columbia have forced the evacuation of over 10,000 residents. Air quality alerts were issued in multiple cities, including Vancouver. Additional updates are expected. Additional updates are expected. Additional updates are expected. Additional updates are expected. Additional updates are expected."
  },
  {
    "title": "Mexico City expands car-free zones",
    "date": "2025-06-26",
    "content": "Officials in Mexico City announced new car-free areas in central districts to reduce air pollution. Pedestrian zones will include expanded sidewalks and cycling lanes. Additional updates are expected. Additional updates are expected. Additional updates are expected. Additional updates are expected. Additional updates are expected. Additional updates are expected."
  },
  {
    "title": "Tokyo unveils AI-based disaster warning system",
    "date": "2025-06-25",
    "content": "Tokyo's metropolitan government introduced a new AI-powered system to predict earthquakes and tsunamis. The system uses real-time seismic data and machine learning to send early warnings via mobile apps. Additional updates are expected. Additional updates are expected. Additional updates are expected. Additional updates are expected. Additional updates are expected."
  },
  {
    "title": "Australia to hold referendum on Indigenous voice to parliament",
    "date": "2025-06-24",
    "content": "Australians will vote in a national referendum this fall on whether to enshrine an Indigenous advisory body in the constitution. Polls show a divided electorate. Additional updates are expected. Additional updates are expected."
  },
  {
    "title": "Germany to phase out nuclear power by 2026",
    "date": "2025-06-23",
    "content": "The German government reaffirmed plans to phase out all remaining nuclear plants by 2026. Critics argue this increases reliance on coal and imported energy. Additional updates are expected. Additional updates are expected. Additional updates are expected. Additional updates are expected."
  },
  {
    "title": "China launches next-gen satellite to monitor global climate",
    "date": "2025-06-22",
    "content": "China has launched a new climate-monitoring satellite to gather real-time data on atmospheric greenhouse gas levels. The satellite will aid in global efforts to track emissions. Additional updates are expected. Additional updates are expected."
  },
  {
    "title": "Italy's Mount Etna erupts, halting flights",
    "date": "2025-06-21",
    "content": "Mount Etna erupted early Tuesday, sending ash clouds into the sky and grounding all flights at Catania Airport. Authorities issued a red alert and evacuated surrounding villages. Additional updates are expected. Additional updates are expected. Additional updates are expected. Additional updates are expected."
  },
  {
    "title": "UK inflation falls to 2.1%, nearing Bank of England target",
    "date": "2025-06-20",
    "content": "The UK's inflation rate fell to 2.1% this quarter, closer to the Bank of England's 2% goal. Analysts say stable energy prices and easing food costs drove the change. Additional updates are expected. Additional updates are expected. Additional updates are expected. Additional updates are expected."
  },
  {
    "title": "South Korea launches lunar lander mission",
    "date": "2025-06-19",
    "content": "South Korea successfully launched its first lunar lander as part of its growing space exploration ambitions. The mission aims to analyze the Moon’s surface composition. Additional updates are expected. Additional updates are expected. Additional updates are expected."
  },
  {
    "title": "Ukraine receives international aid to rebuild infrastructure",
    "date": "2025-06-18",
    "content": "Ukraine has secured over $15 billion in international aid to repair infrastructure damaged by war. Projects include power grid restoration, housing, and rail systems. Additional updates are expected. Additional updates are expected. Additional updates are expected. Additional updates are expected."
  },
  {
    "title": "India sees record monsoon rains displacing thousands",
    "date": "2025-06-17",
    "content": "Heavy monsoon rains in India have displaced over 50,000 residents across low-lying areas. Relief camps have been set up in Kerala and Maharashtra. Flooding has damaged critical infrastructure. Additional updates are expected. Additional updates are expected. Additional updates are expected. Additional updates are expected."
  },
  {
    "title": "South Africa experiences countrywide power outage",
    "date": "2025-06-16",
    "content": "A technical failure at a major substation caused widespread power outages across South Africa, affecting Johannesburg, Cape Town, and Durban. Officials say repairs are ongoing. Additional updates are expected. Additional updates are expected."
  },
  {
    "title": "NASA confirms discovery of potential habitable exoplanet",
    "date": "2025-06-15",
    "content": "NASA’s James Webb Space Telescope has identified an exoplanet located 120 light-years away with possible signs of water vapor. Scientists believe the planet, named Gliese 581g, may support life. Additional updates are expected. Additional updates are expected. Additional updates are expected. Additional updates are expected. Additional updates are expected. Additional updates are expected."
  },
  {
    "title": "Brazil’s Amazon deforestation drops by 34%",
    "date": "2025-06-14",
    "content": "The Brazilian government announced a 34% decrease in Amazon deforestation compared to last year. Environmental groups credited enforcement efforts and satellite monitoring. Additional updates are expected. Additional updates are expected. Additional updates are expected. Additional updates are expected. Additional updates are expected. Additional updates are expected."
  }
]