[
    {
      "title": "Venezuelan man accused of posing as teen in Perrysburg pleads not guilty",
      "date": "2025-06-30",
      "content": "A Venezuelan man is facing a charge after allegedly posing as a teenager in Perrysburg, Ohio. Police say he enrolled in local schools under false information. Authorities say the man used fake documents to register. Officials were alerted after staff noticed inconsistencies in his records. Investigators are reviewing how long he maintained the deception and if anyone aided him. The suspect remains in custody pending further hearing."
    },
    {
      "title": "Child dies in riding lawn mower accident, deputies say",
      "date": "2025-06-29",
      "content": "A young child was killed in a tragic riding lawn mower accident in Lucas County. Deputies report the child was operating the equipment when it collided with a tree, causing fatal injuries. The county coroner pronounced the child dead at the scene. No charges have been filed as the incident is still under investigation. Authorities are reminding residents to supervise children around heavy machinery."
    },
    {
      "title": "Third generation Mohr family member remembers time in factory that burned down over the weekend",
      "date": "2025-06-29",
      "content": "A longtime member of the Mohr family shared memories of working at the bottling factory in Toledo which caught fire last weekend. The three‑alarm blaze consumed most of the century old building. “It was where my father worked, my grandfather before him,” the family member said. Neighbors recall hearing an explosion before seeing flames and smoke. Fire crews battled the fire for hours. No injuries were reported."
    },
    {
      "title": "I-TEAM: Where is Toledo firefighter union fact‑finder report?",
      "date": "2025-06-29",
      "content": "Toledo’s firefighter union has been awaiting a fact‑finder report since early spring, but city officials insist it’s under review. The union says the delay is hampering negotiations. Both sides met in closed session Tuesday, but no resolution was announced. The city maintains the report will be public once reviewed. Union leaders argue firefighters deserve transparency. The state mediator has been notified."
    },
    {
      "title": "One dead, one injured following shooting on Lincolnshire Blvd. during large party",
      "date": "2025-06-29",
      "content": "Police responded to a shooting late Saturday on (Toledo) after a large party turned violent. One person was shot dead, another injured. Authorities say several people fled before officers arrived. The incident remains under investigation; no arrests yet. Detectives are reviewing surveillance footage and interviewing witnesses. Residents are urged to report any information anonymously."
    },
    {
      "title": "OKC residents in the area during Bricktown shooting say they heard seven gunshots",
      "date": "2022-12-11",
      "content": "Oklahoma City Police are investigating a Bricktown shooting that hospitalized two people after hearing seven shots ring out near Wanda Jackson Way and Reno Avenue. A couple waiting in their vehicle at a concert exit said they heard rapid gunfire. They described police response arriving within a minute and setting up a perimeter. No motive has been established; investigations continue. Surveillance footage is being reviewed."
    },
    {
      "title": "OKC Street Department Employee Believes Shooting Of Co‑Worker Was Targeted",
      "date": "2023-06-28",
      "content": "An Oklahoma City street department crew was shaken when an employee was grazed in the leg by gunfire while working on Hefner Road. Witnesses say two suspects exited a vehicle and targeted a coworker. The victim was treated on scene; no life‑threatening injuries. Police believe the attack was targeted. Bullet casings were recovered. The victim was taken in a private vehicle. Authorities are seeking tips via Crime Stoppers."
    },
    {
      "title": "OCPD: One dead after shooting in southwest Oklahoma City",
      "date": "2025-01-04",
      "content": "Dispatchers responded to a shooting in the 9300 block of Southwest 45th Court around 9 a.m. Saturday. Officers found a person deceased from apparent gunshot wounds following an argument at a gathering. The alleged shooter was arrested on site. Witnesses were interviewed. Police say no further threat persists. The incident is considered isolated and investigation ongoing."
    },
    {
      "title": "OCPD: Person shot in northwest Oklahoma City",
      "date": "2025-01-16",
      "content": "Police are investigating a non‑fatal shooting at an apartment complex on Northwest 6th Street near Rockwell and Melrose. Officials say the victim, shot in the torso, was taken to a local hospital and is expected to survive. The suspect fled before police arrived. Investigators are canvassing the area and reviewing footage. No arrests yet."
    },
    {
      "title": "Portland Winter Ice Rink opens downtown",
      "date": "2024-12-15",
      "content": "The Portland Winter Ice Rink has opened beneath the Morrison Bridge downtown, offering 80×50 feet of skating surface covered by canvas. For 2024‑25, organizers increased its size to 5,000 square feet and added an observation deck. The rink operates daily with seasonal workers. A pop‑up holiday village offers food, games, fire pits, and seating. Economic development officials say high demand returned after last year’s debut."
    },
    {
      "title": "Woodsy Winter Village, outdoor ice rink open in downtown Portland",
      "date": "2023-12-14",
      "content": "The ice rink and Woodsy Winter Village opened Saturday on the west end of the Morrison Bridge. Starting this Saturday, an outdoor ice rink and “Woodsy Winter Village” are opening up near the west end of the Morrison Bridge. If anyone spends $20 at any downtown retailer in December, people can get $5 off a skate ticket. As a member of the Prosper Portland Office of Events and Film, Nelson said it was a dream to bring a winter wonderland to the central city."
    },
    {
      "title": "Portland winter ice rink makes a return to the Rose City: 'Create holiday traditions'",
      "date": "2024-11-04",
      "content": "For the second year in a row, the Rose City has brought back the winter ice rink. Construction of the rink started on Nov. 4 and was ready to go by Friday. Thousands of people will once again be making holiday memories underneath the Morrison Bridge this year, with the rink open from Nov. 16 to Jan. 5, from 10 a.m. to 10 p.m. for 90‑minute skating sessions."
    },
    {
      "title": "Downtown's pocket ice rink is staying to Feb. 11",
      "date": "2024-01-22",
      "content": "The pop‑up Portland Winter Ice Rink will stay in its location near the waterfront an extra two weeks, say city officials. The rink was an instant success when it opened Dec. 16, selling around 12,000 tickets in its first two weeks, according to city officials."
    },
    {
      "title": "Portland Winter Ice Rink returns for season",
      "date": "2024-11-16",
      "content": "Portland’s outdoor ice‑skating rink has officially returned to downtown Portland. The rink is located at 499 Southwest Naito Parkway, near Tom McCall Waterfront Park and the Morrison Bridgehead. Starting Saturday, it will operate daily from 10 a.m. to 10 p.m. until Sunday, Jan. 5."
    },
    {
      "title": "Outdoor ice skating rink, 'Woodsy Winter Village' to open in downtown Portland in December",
      "date": "2023-11-15",
      "content": "As part of a push from Portland leaders to bring shoppers and crowds to downtown Portland this holiday season, the city announced Wednesday that an ice skating rink and a holiday marketplace called “Woodsy Winter Village” will open next month in downtown Portland."
    },
    {
      "title": "Portland Winter Ice Rink returns in November",
      "date": "2024-10-14",
      "content": "The Portland Winter Ice Rink next to Tom McCall Waterfront Park opens back up to the public next month. Construction begins Nov. 4 and is set to be completed by Nov. 15. Skaters of all ages can get into the holiday spirit with 90‑minute skating sessions from 10 a.m. to 10 p.m."
    },
    {
      "title": "Outdoor winter ice rink under construction",
      "date": "2024-11-04",
      "content": "The rink is expected to be ready by mid‑November for thousands to make holiday memories underneath the Morrison Bridge (Portland) again this year."
    },
    {
      "title": "Portland outdoor ice rink opens",
      "date": "2024-11-16",
      "content": "Last year, 20,000 people came down to the rink to skate; organizers with Prosper Portland are hoping to double those numbers."
    },
    {
      "title": "Portland extends outdoor winter ice rink into February",
      "date": "2024-01-22",
      "content": "Portland has decided to keep its outdoor ice rink open through Feb. 11. From Dec. 16 to 31, the ice rink sold roughly 12,000 tickets and generated more than $228,800 in revenue, according to Prosper Portland."
    },
    {
      "title": "Venezuelan man accused of posing as teen in Perrysburg pleads not guilty",
      "date": "2025-06-30",
      "content": "A Venezuelan man is facing a charge after allegedly posing as a teenager in Perrysburg, Ohio. Police say he enrolled in local schools under false information. Authorities say the man used fake documents to register. Officials were alerted after staff noticed inconsistencies in his records."
    },
    {
      "title": "Gun violence dips in King County, but concerns remain",
      "date": "2025-02-21",
      "content": "Gun violence in King County dropped in 2024, marking the first decline in six years, according to a report from the King County Prosecuting Attorney's Office. Compared to 2023, the region saw a 29% drop in fatal shooting victims, a 13% decrease in non‑fatal shooting incidents and a 6% overall decline in reported shots fired. Seattle accounted for 51% of both firearm homicides and nonfatal shootings, with most other cases happening in southern county areas. Efforts include Mayor Bruce Harrell's push to recruit more police officers and install CCTV in key neighborhoods."
    },
    {
      "title": "Suburban Seattle officer gets over 16 years in prison for fatally shooting a homeless man",
      "date": "2025-01-23",
      "content": "A suburban Seattle police officer was sentenced Thursday to over 16 years in prison for the 2019 shooting death of a homeless man he was trying to arrest for disorderly conduct. A jury found Jeffrey Nelson guilty of second‑degree murder and first‑degree assault in the death of Jesse Sarey. The sentence is the first under Washington’s law aimed at prosecuting officers for on‑duty killings. Video evidence contradicted Nelson's claim of self‑defense, leading to convictions and concurrent prison terms. The case highlights growing scrutiny of police use of force."
    },
    {
      "title": "Lake City shooting leaves man dead, woman injured – KIRO 7 News",
      "date": "2024-12-12",
      "content": "Seattle homicide detectives are investigating a shooting in the Lake City neighborhood that left one man dead and a woman injured Wednesday night. At 5:21 p.m., 911 dispatchers received reports of gunfire in the 12000 block of 33rd Avenue Northeast. Officers found a 41‑year‑old woman and a 31‑year‑old man suffering from multiple gunshot wounds. Both were transported to Harborview Medical Center; the man died and the woman remains hospitalized. The suspect fled, and detectives are pursuing leads. Contacts are asked to call the SPD Violent Crimes Tip Line."
    },
    {
      "title": "Police investigating shooting that left a man dead in the Central District of Seattle",
      "date": "2024-08-24",
      "content": "Police are investigating after a shooting left one person dead in the Central District of Seattle. Seattle Police answered a call of a shooting at an apartment building in the 1800 block of South Jackson Street. A 44‑year‑old man was found with multiple gunshot wounds. Seattle Fire transported him to Harborview Medical Center, where he was pronounced dead. Police heard an altercation before the shots. Investigators have turned the case over to the Homicide Unit and are asking for tips at the Violent Crimes Tip Line."
    },
    {
      "title": "Man dead, woman hospitalized in downtown shooting",
      "date": "2025-01-25",
      "content": "A man is dead and a woman left hospitalized following an overnight shooting in Downtown Seattle's Pioneer Square neighborhood. Police confirm it’s the city’s first homicide of 2025. At around 1:30 a.m., gunfire broke out near South Main Street and 2nd Ave South. Officers found a 40‑year‑old man dead in his car and a 23‑year‑old woman at Swedish Hospital. About 45 shell casings were recovered. SPD urges anyone with information to call the Violent Crimes Tip Line."
    },
    {
      "title": "Seattle Police investigating accidental shooting",
      "date": "2025-04-13",
      "content": "A man accidentally shot himself in the forearm early Sunday morning in Capitol Hill, according to the Seattle Police Department. Just after midnight, he was unloading a handgun when it fired through his forearm and hit a wall. Nearby witnesses called 911 and applied pressure to the wound before medics arrived. No other injuries were reported and no charges have been filed. SPD reminds residents to handle firearms responsibly."
    },
    {
      "title": "Seattle Police SWAT arrests suspect in Aurora Ave. shooting",
      "date": "2025-06-13",
      "content": "Seattle Police SWAT have arrested a man in a shooting that happened Friday morning on Aurora Avenue North. One man was shot and taken to Harborview Medical Center in stable condition. The incident occurred around 11:31 a.m. near North 100th Street. The suspect fled but was arrested near North 96th Street two hours later. Police ask anyone with information to contact the SPD Violent Crimes Tip Line."
    },
    {
      "title": "San Jose fire station burglarized",
      "date": "2025-01-22",
      "content": "A fire station in San Jose was hit by thieves on Saturday night, prompting calls for enhanced security at city firehouses. Fire Station 8 on East Santa Clara Street was burglarized, and equipment along with personal belongings were stolen. Fire officials and the mayor emphasized the need for better protection. Mayor Matt Mahan and Battalion Chief Herrera highlighted security upgrades. The intruder, an unhoused resident, was arrested, and all items were recovered except a destroyed laptop."
    },
    {
      "title": "2-alarm fire burns South San Jose residential structure",
      "date": "2025-01-22",
      "content": "A residential building fire in the Cambrian neighborhood left 16 residents displaced Friday afternoon. The San Jose Fire Department responded to a two‑story fourplex on Bradford Way. The fire affected upstairs units and caused water and smoke damage below. PG&E crews disconnected power and gas. No injuries were reported. The Red Cross assisted displaced residents. Investigators continue to determine the cause."
    },
    {
      "title": "‘First responder fee’ tacks $427 charge on 911 calls",
      "date": "2025-03-28",
      "content": "Starting January 1, 2026, the San Jose Fire Department will implement a $427 'first responder fee' for emergency medical services provided by firefighters. The city council approved the plan, which will be billed to insurance companies. The fee aims to generate $4 million annually. Fire Chief Robert Sapien said similar programs didn’t deter 911 calls. Some residents worry it may discourage people from calling when needed."
    },
    {
      "title": "Downtown Denver records a drop in crime amid new policing efforts",
      "date": "2025-05-12",
      "content": "Denver police report a 15% decline in property crime in the downtown area this year compared to 2024. The department attributes the drop to expanded foot-patrol units, increased CCTV surveillance, and community partnerships. Business owners in the 16th Street Mall say they feel safer during evening hours. However, police acknowledge that violent crime rates have remained fairly consistent, with concerns over occasional rooftop robberies. Plans are underway to install additional lighting in alleyways and back entrances."
    },
    {
      "title": "Aurora celebrates opening of new recreation center",
      "date": "2025-04-18",
      "content": "Officials and residents gathered Tuesday for the grand opening of Aurora’s new East Side Recreation Center. The $22 million facility includes a gymnasium, indoor pool, fitness area, and community meeting rooms. “This center is a space for families to gather, play, and stay active,” said City Council member Elena Martinez. The center is expected to serve over 5,000 visitors per month and offers after-school programming for local students."
    },
    {
      "title": "Phoenix heatwave triggers citywide cooling centers",
      "date": "2025-06-10",
      "content": "A record-breaking heatwave hitting Phoenix prompted the city to open cooling centers across all 15 public libraries, community centers, and senior facilities. Temperatures soared above 115°F over the weekend, and the City Emergency Operations Center issued heat alerts. Officials encouraged residents to stay hydrated, avoid outdoor activities from noon to 4 p.m., and check on elderly neighbors. The initiative also includes pet-friendly cooling zones."
    },
    {
      "title": "Tempe police investigating shooting outside ASU fraternity house",
      "date": "2025-03-01",
      "content": "Tempe police are investigating a non-fatal shooting outside a fraternity house near Arizona State University early Sunday morning. Officers responded after getting a call about gunfire at about 2:15 a.m. A 21-year-old student was struck in the leg and taken to a local hospital in stable condition. Witnesses say shots rang out during a party. No suspects are in custody yet."
    },
    {
      "title": "Richmond Rapids marathon draws thousands on Father’s Day",
      "date": "2025-06-15",
      "content": "The annual Richmond Rapids Marathon attracted over 8,000 runners Sunday morning in Richmond’s Fan District. The race included full, half, and 5K events. Mayor James Thornton took part in the 5K, finishing near the front of his age group. Aid stations along Monument Avenue served water and electrolyte drinks, and bands provided live music. Organizers reported raising $50,000 for local youth sports programs."
    },
    {
      "title": "Charleston waterfront flooding prompts road closures",
      "date": "2025-05-27",
      "content": "High tides and a strong spring tide caused waterfront flooding in downtown Charleston over the weekend, prompting closures of East Bay Street and Cumberland Street. City officials deployed pumps and sandbags. Residents were advised to avoid the area, as sidewalks and parking lots were submerged. The National Weather Service forecast more tidal flooding through mid-week, and mitigation efforts remain in place."
    },
    {
      "title": "South Bend approves $3 million park renovation",
      "date": "2025-04-05",
      "content": "The South Bend City Council voted unanimously Thursday to allocate $3 million to revamp Soldiers Field Park. Planned upgrades include new playground equipment, walking trails, lighting, and landscaping. The project is scheduled to begin in late summer and finish by next spring. Parks Superintendent Laura Chen said the improvements will enhance community engagement and youth recreation."
    },
    {
      "title": "Boston-area commuter rail delays due to track maintenance",
      "date": "2025-06-01",
      "content": "Commuter rail riders in eastern Massachusetts experienced delays this morning after scheduled track maintenance between Boston South Station and Worcester. Trains were operating at reduced speeds, with delays of up to 25 minutes. MBTA officials apologized and advised travelers to allow extra time or use alternate routes. Maintenance is expected to continue throughout the week during off-peak hours."
    },
    {
      "title": "Madison farmers market resumes with increased vendor lineup",
      "date": "2025-05-03",
      "content": "The Dane County Farmers Market reopened Saturday on the Capitol Square in Madison, with over 180 vendors offering produce, crafts, cheese, and baked goods. The market's Saturday morning foot traffic reached record levels, with live music and cooking demonstrations drawing crowds. City officials and local farmers say the expanded market supports small businesses and promotes healthy eating."
    },
    {
      "title": "Jacksonville Council approves funding for riverfront revitalization",
      "date": "2025-06-20",
      "content": "The Jacksonville City Council voted 7-2 to allocate $15 million for the Jacksonville Riverwalk renovation project. Improvements include walking paths, landscape enhancements, public art installations, and upgraded lighting. The project aims to attract more visitors to downtown and boost local commerce. Council President Maria Sanchez said the renovation will “bring our city’s heart back to life.”"
    },
    {
      "title": "A Nebraska officer who fatally shot an unarmed man will be fired, police chief says",
      "date": "2024-09-25",
      "content": "Omaha’s police chief on Wednesday said he is firing an officer who fatally shot an unarmed man while serving a no‑knock warrant. Officer Adam Vail was part of a SWAT team serving a search warrant when he fired the single shot that killed 37‑year‑old Cameron Ford. The officer said Ford charged at him without showing his hands. Although no charges were filed, an internal investigation found policy violations. Vail will get a chance to appeal before the firing is final. Mayor Jean Stothert backed the decision, citing accountability."
    },
    {
      "title": "Prosecutor says Omaha officer was justified in fatally shooting fleeing man",
      "date": "2024-10-07",
      "content": "Douglas County Attorney Don Kleine said Officer Noah Zendejas’s use of deadly force was justified after Steven Phipps, armed with a gun, fled from a traffic stop and scaled a fence. Body‑camera footage showed Phipps holding the firearm pointed toward officers. Community members voiced concern, citing recent police‑involved shootings, including the camera‑free no‑knock warrant incident. Omaha has seen a rise in police shootings, with five reported this year, four of them fatal."
    },
    {
      "title": "No charges for off-duty officers in fatal shooting of 2 men outside Nebraska bar",
      "date": "2024-02-08",
      "content": "Two off‑duty Omaha police officers will not face charges after fatally shooting two men outside a nightclub. Douglas County prosecutors said surveillance video showed one man fired a gun at the crowd, prompting return fire from the officers. The officers had body‑camera footage but it wasn’t activated until after the shooting. The men killed were undocumented immigrants. The incident sparked calls for a federal investigation from local Latino advocacy groups."
    },
    {
      "title": "Nebraska man who shot inside Target got rifle 4 days earlier",
      "date": "2023-03-12",
      "content": "A 32‑year‑old man entered a suburban Omaha Target store carrying an AR‑15‑style rifle, which he had purchased four days earlier. He fired several rounds inside, causing panic, though no one else was injured. Police later shot and killed him. The man’s uncle said he had schizophrenia. Law enforcement and mental‑health experts pointed to the ease of obtaining powerful firearms and the risks posed by those with serious mental illness."
    },
    {
      "title": "Shooting in North Omaha kills one, sends four more to hospital",
      "date": "2025-01-12",
      "content": "A shooting in North Omaha on Sunday morning killed one man and sent four others to the hospital. Omaha Police responded after a ShotSpotter alert near 24th and Binney streets around 3 a.m. Two people were found at the scene and three more showed up at CHI Bergan Mercy Hospital with non‑life‑threatening injuries. One victim, 37‑year‑old Brandon Jones, later died at Nebraska Medicine. The investigation remains active and detectives are seeking tips."
    },
    {
      "title": "Teen killed, man wounded in North Omaha shooting",
      "date": "2025-03-25",
      "content": "A shooting Tuesday morning in North Omaha left a 15‑year‑old dead and a 20‑year‑old man wounded, police said. Officers responded near 52nd and Pinkney around 10:30 a.m. The injured were taken to Nebraska Medicine; the teen later died. Omaha Public Schools briefly secured three nearby schools during the incident. The shooter remains at large; OPD is urging anyone with information to come forward."
    },
    {
      "title": "One person critically injured in shooting Saturday morning",
      "date": "2025-05-11",
      "content": "Omaha Police responded to a shooting near 42nd and Ames Avenue early Saturday morning that left one person critically injured. A 42‑year‑old suspect was arrested and faces charges including possession of a firearm by a prohibited person. The victim was taken to the hospital and is expected to survive. Police are investigating and searching for a second suspect believed involved in the incident."
    },
    {
      "title": "One injured, one detained after shooting in South Omaha",
      "date": "2025-02-23",
      "content": "Omaha Police say one person was injured and another detained after a shooting in South Omaha Sunday morning. The incident occurred around 11 a.m. near 11th and Center streets. The injured, a 28‑year‑old, was taken to Nebraska Medicine with non‑life‑threatening injuries. The person detained is considered a person of interest. Investigators are continuing interviews and canvassing the area."
    },
    {
      "title": "Police give update on shooting in North Omaha that injured one",
      "date": "2025-03-15",
      "content": "Omaha police provided details on a North Omaha shooting that left one person injured. The incident occurred mid‑morning near [redacted address], prompting a heavy law enforcement response. The victim suffered non‑life‑threatening injuries and was treated at a local hospital. Officers are reviewing surveillance video and asking the public for tips."
    },
    {
      "title": "Fatal shooting at Omaha gas station",
      "date": "2024-01-20",
      "content": "Omaha Police responded to a fatal shooting at a Casey’s gas station near 72nd and Grover streets Saturday afternoon. Three people were found shot inside a vehicle; one died. Investigators say the shooting stemmed from an argument inside the vehicle. Preliminary evidence shows it was not a random act of violence. Detectives are reviewing surveillance footage and interviewing witnesses."
    }, 
    {
      "title": "San Antonio festival organizers cancel event after flash flood warnings",
      "date": "2025-05-18",
      "content": "Organizers of the annual Fiesta Noche del Rio in San Antonio canceled the opening night performance Saturday evening due to severe thunderstorms and flash flood warnings. The riverwalk stage area was soaked, and city officials feared safety risks to performers and guests. Attendees were refunded and advised to stay safe. Officials are monitoring weather forecasts to determine if the show can be rescheduled later in the week."
    },
    {
      "title": "Indianapolis to bring electric buses to downtown",
      "date": "2025-04-02",
      "content": "IndyGo, Indianapolis’ public transit system, announced rolling out 20 new electric buses in downtown service starting next month. Officials say the buses will reduce emissions and noise during peak commute hours. The city secured federal grants covering 80% of the cost. The pilot program includes charging stations at the main transit center, with hopes of expanding fleet in 2026."
    },
    {
      "title": "Atlanta opens new shelter for unhoused residents during heatwave",
      "date": "2025-06-22",
      "content": "The city of Atlanta opened a new daytime cooling shelter inside the Martin Luther King Jr. recreation center as temperatures soared past 100°F. The shelter provides water, air conditioning, and respite from the heat for people experiencing homelessness. Officials said volunteers will distribute health resources and hygiene kits. The shelter will remain open until the heat advisory is lifted."
    },
    {
      "title": "Cleveland schools to receive new air filters amid mold concerns",
      "date": "2025-03-15",
      "content": "Cleveland’s school district announced plans to install HEPA air filters in all classrooms after routine inspections uncovered mold and poor ventilation in several buildings. Superintendent Maria King called the plan “critical for student health.” Work will start over spring break to minimize disruptions. The initiative follows complaints from parents and teachers about respiratory illnesses in older facilities."
    },
    {
      "title": "Albuquerque transit expands bus service to South Valley",
      "date": "2025-05-08",
      "content": "The Albuquerque Transit Department launched two new bus routes serving the South Valley area, providing reliable transportation to jobs and schools. The routes were approved by the city council last year and began service this week. City officials said the expansion supports equity and will be monitored for ridership and punctuality."
    },
    {
      "title": "Tampa Bay fireworks canceled amid safety concerns at Amalie Arena",
      "date": "2025-07-01",
      "content": "Tampa Bay Lightning announced they have canceled the post-game fireworks show scheduled for tonight at Amalie Arena due to unexpected high winds. Organizers cited public safety risks. Ticket holders were informed via email; arena management said the decision was made in consultation with city emergency services."
    },
    {
      "title": "Milwaukee riverwalk to reopen after stain remediation",
      "date": "2025-04-25",
      "content": "The Riverwalk in downtown Milwaukee is set to reopen after crews cleared algae and oil stains that made the walkways slippery. Maintenance crews pressure-washed the area early Saturday and added improved drainage. Visitors are advised to bring athletic footwear while walking until cleanup finishes."
    },
    {
      "title": "Kansas City mayor proposes $2M park renovation in Northland",
      "date": "2025-05-22",
      "content": "Kansas City’s mayor unveiled a proposal to invest $2 million in renovating a park in the Northland area, including upgraded playgrounds, a splash pad, and walking paths. Community meetings are scheduled to gather input. The renovation aims to improve youth recreation and neighborhood connectivity."
    },
    {
      "title": "Las Vegas workers protest pay at Strip casino",
      "date": "2025-06-10",
      "content": "Employees at a major Las Vegas Strip casino picketed outside the property Sunday to demand wage increases and tipping transparency. The union-led protest included chants and signs reading “Fair Pay Now.” Casino management said they are reviewing labor agreements and look forward to productive discussions."
    },
    {
      "title": "Louisville installs bike lanes downtown to promote commuting",
      "date": "2025-05-30",
      "content": "The city of Louisville completed installation of protected bike lanes along Market Street in downtown as part of its Vision Zero traffic safety plan. City officials say the lanes will encourage biking and reduce vehicle-pedestrian conflicts. Councilwoman Rebecca Franklin praised the move, noting research shows bike commuting increased by 12% in similar cities."
    },
    {
      "title": "Nashville police release bodycam after deadly crash on Broadway",
      "date": "2025-06-18",
      "content": "Nashville police released body-camera footage following a crash that killed one and injured two others on Broadway Saturday night. The video shows the suspect vehicle speeding through red lights before hitting a pedestrian and crashing into storefronts. Police arrested the driver, a 24-year-old, on charges of vehicular homicide and DUI. The crash sparked calls for sidewalks and pedestrian safety improvements in the downtown entertainment district."
    },
    {
      "title": "Salt Lake City to build new affordable housing near TRAX station",
      "date": "2025-05-14",
      "content": "City officials in Salt Lake City announced plans to build a 120-unit affordable housing complex near the Central City TRAX station. The project, backed by state grants, aims to serve low-income families and individuals experiencing homelessness. The development includes community spaces, onsite case management, and retail on the ground level. Construction is expected to begin this fall with completion aimed for 2027."
    },
    {
      "title": "Charlotte-Mecklenburg Schools to add mental health counselors in 20 schools",
      "date": "2025-04-22",
      "content": "The CMS school board approved adding full-time mental health counselors to 20 middle and high schools across Charlotte-Mecklenburg. District leaders said the program addresses growing student anxiety and stress. Counselors will be hired over the next few months and will provide both individual and group support. Officials aim to expand counseling services district-wide in future years."
    },
    {
      "title": "Detroit launches summer youth jobs program with 5,000 slots",
      "date": "2025-06-05",
      "content": "The city of Detroit launched a new summer jobs initiative offering 5,000 paid internships for local youth aged 16 to 24. Mayor Johnson said the program aims to provide job experience and mentorship for Detroit teens in city departments and nonprofit organizations. Applications opened last week, and positions begin in July."
    },
    {
      "title": "Columbus police investigate weekend homicide in East Side",
      "date": "2025-06-28",
      "content": "Columbus police are investigating a fatal shooting that occurred early Saturday morning in the East Side neighborhood. Officers found a single adult male victim suffering from multiple gunshot wounds at the scene. The victim was pronounced dead on arrival. No suspects have been identified, and detectives are asking for anyone with information to contact the Violent Crimes Unit."
    },
    {
      "title": "Memphis festival postponed due to heavy rains",
      "date": "2025-06-20",
      "content": "Organizers of the Memphis RiverFest music festival announced a postponement this weekend due to heavy rain and flash flood warnings. The festival, scheduled along the downtown riverfront, will now be held next month. Ticket holders will be notified via email about the new date. City parks officials will conduct an inspection before reopening the lawn areas."
    },
    {
      "title": "Oklahoma City opens new playground in NW district",
      "date": "2025-06-15",
      "content": "Oklahoma City officials cut the ribbon on a new playground in the northwest district Saturday. The park includes accessible equipment, shaded seating, and walking paths. Families and city leaders attended the ceremony. The project is part of the city’s parks master plan aimed at improving neighborhood amenities."
    },
    {
      "title": "Salt Lake City police seize significant fentanyl haul in raid",
      "date": "2025-04-10",
      "content": "Salt Lake City police announced they seized over 20 pounds of fentanyl during a raid on a suspected drug trafficking operation in the west side. The bust is one of the largest in recent city history. Multiple arrests were made, and investigators continue efforts to dismantle trafficking networks."
    },
    {
      "title": "Charlotte officer honored for saving toddler during traffic stop",
      "date": "2025-02-27",
      "content": "A Charlotte-Mecklenburg police officer received a commendation Tuesday for rescuing a 2-year-old girl found alone in a hot car during a traffic stop. The officer removed the child, shaded her, and administered water while calling EMS. The child was unharmed and released to her parents. CMS police chief praised the quick thinking officer at a ceremony."
    },
    {
      "title": "Nashville council approves new bike lanes downtown",
      "date": "2025-05-01",
      "content": "The Nashville Metro Council unanimously approved a plan to install protected bike lanes along 4th Avenue and Broadway. The project aims to improve cyclist safety and reduce vehicle-bicycle collisions. Construction is expected to begin this summer, with completion slated for early next year."
    },
    {
      "title": "Grand Rapids city council approves downtown safety camera plan",
      "date": "2025-06-10",
      "content": "The Grand Rapids City Council voted to install 50 new public safety cameras in high-traffic downtown sectors to help monitor for crimes and coordinate emergency responses..."
    },
    {
      "title": "Boise launches pop-up splash pads to beat heat",
      "date": "2025-06-22",
      "content": "Boise Parks & Rec rolled out temporary splash pads at five neighborhood parks this week, offering relief from record-breaking summer temperatures..."
    },
    {
      "title": "Albuquerque council approves new bike-share stations",
      "date": "2025-06-05",
      "content": "Albuquerque City Council approved funding for 30 additional Bikeshare stations, expanding access to underserved neighborhoods..."
    },
    {
      "title": "Cleveland reopens historic West Side Market arcade",
      "date": "2025-06-17",
      "content": "Cleveland officials celebrated the reopening of the West Side Market arcade after a 9-month renovation..."
    },
    {
      "title": "Durham expands summer literacy program for elementary students",
      "date": "2025-06-12",
      "content": "Durham Public Schools announced a major expansion of its summer reading program, now available to all K–5 students..."
    },
    {
      "title": "Wichita opens new tech training center in partnership with Boeing",
      "date": "2025-06-20",
      "content": "A new aviation technology training center opened in Wichita thanks to a partnership between the city and Boeing..."
    },
    {
      "title": "St. Louis begins pilot for fare-free public buses",
      "date": "2025-06-14",
      "content": "St. Louis Metro Transit launched a six-month fare-free bus pilot program this week on selected routes..."
    },
    {
      "title": "Reno hosts inaugural citywide night market downtown",
      "date": "2025-06-21",
      "content": "Reno held its first-ever citywide night market in the downtown corridor on Saturday, drawing thousands of attendees..."
    },
    {
      "title": "Anchorage opens permanent warming center ahead of winter",
      "date": "2025-06-01",
      "content": "Anchorage unveiled its first year-round warming center aimed at supporting residents experiencing homelessness..."
    },
    {
      "title": "Madison launches solar panel rebate program",
      "date": "2025-06-19",
      "content": "The City of Madison introduced a new solar rebate program for homeowners and small businesses installing solar panels..."
    },
    {
      "title": "Little Rock to convert abandoned mall into public services hub",
      "date": "2025-06-16",
      "content": "Little Rock announced plans to repurpose the shuttered Southgate Mall into a public services hub housing a DMV branch..."
    },
    {
      "title": "Spokane adds 10 electric buses to transit fleet",
      "date": "2025-06-09",
      "content": "Spokane Transit Authority unveiled 10 new electric buses now serving high-volume routes across the city..."
    },
    {
      "title": "Des Moines expands urban farm grants to support food deserts",
      "date": "2025-06-03",
      "content": "Des Moines launched its second round of urban agriculture grants, offering up to $15,000 to nonprofits and residents..."
    },
    {
      "title": "Fayetteville opens pedestrian bridge connecting downtown and university",
      "date": "2025-06-08",
      "content": "Fayetteville officials opened a new pedestrian and bike bridge over Highway 71, linking downtown with the University of Arkansas campus..."
    },
    {
      "title": "Huntsville approves downtown waterfront revitalization",
      "date": "2025-06-06",
      "content": "The Huntsville City Council approved an ambitious plan to revitalize the downtown waterfront district with new parks, trails, and public art..."
    },
    {
      "title": "Augusta introduces curbside glass recycling",
      "date": "2025-06-13",
      "content": "Augusta, Georgia, has reinstated glass recycling with a new curbside pickup program..."
    },
    {
      "title": "Sioux Falls offers new home repair grants to seniors",
      "date": "2025-06-02",
      "content": "Sioux Falls Housing Department launched a home repair grant program for seniors over 65..."
    },
    {
      "title": "Lancaster police increase patrols near schools after uptick in incidents",
      "date": "2025-06-11",
      "content": "Lancaster police said they’re increasing patrols near schools following several reports of suspicious activity..."
    },
    {
      "title": "Topeka debuts community mural in NOTO arts district",
      "date": "2025-06-07",
      "content": "Topeka unveiled a new community mural in the NOTO Arts District painted by local artists and volunteers..."
    },
    {
      "title": "Akron to host first downtown film series in city park",
      "date": "2025-06-15",
      "content": "Akron Parks & Recreation will host a weekly outdoor film series downtown starting June 28..."
    }
]
  